#!/bin/bash

curl --request POST "http://localhost:30001/api/detection_engine/rules" \
  -H "Authorization: Basic $ELASTICSEARCH_AUTH_BASE64" \
  -H "Content-Type: application/json" \
  -H "kbn-xsrf: true" \
--data '{
  "name": "Possible Malicious Word Doc",
  "description": "Possible Malicious Word Doc",
  "risk_score": 70,
  "severity": "medium",
  "type": "eql",
  "language": "eql",
  "query": "sequence with maxspan=30s [process where process.name : \"*.exe\" and event.action == \"creation\" and file.name: \"*.doc\" or file.name: \"*.docx\"] [network where source.bytes > 10000000]",
  "index": ["logs-*", "packetbeat-*", "filebeat-*"],
  "interval": "5m",
  "from": "now-6m",
  "enabled": true,
  "actions": [],
  "throttle": "no_actions",
  "timestamp_override": "event.ingested"
  }'
